package com.monora.personalbothub.bot_impl.util.modbus.enums;

public enum ConfigParameter {
    // Общие параметры
    DEV("dev", 0xD681, "Название прибора", "ASCII", ""),
    VER("ver", 0x2D5B, "Версия встроенного ПО", "ASCII", ""),

    // Параметры входов
    CJC("Cj-.C", 0xFA68, "Автоматическая коррекция по температуре свободных концов ТП", "int8", "0..1"),
    IN_RE("in.rE", 0x132C, "Резервирование датчика", "int8", "0..1"),
    IN_T("in-t", 0x932D, "Тип датчика по Входам", "int8", "0..36"),
    IN_FD("in.Fd", 0x1659, "Постоянная времени цифрового фильтра по Входам", "int16", "0..1800"),
    IN_FG("in.FG", 0x340A, "Полоса цифрового фильтра по Входам", "int16", "0..9999"),
    ITRL("itrL", 0x7F16, "Период опроса датчика по Входам", "int16", "0.3..30"),
    IN_SH("in.SH", 0xF6AB, "Сдвиг характеристика датчика по Входам", "STORED_DOT", "-999..9999"),
    IN_SL("in.SL", 0x20B6, "Наклон характеристики датчика по Входам", "int16", "0.9..1.1"),
    AIN_L("Ain.L", 0x34E0, "Нижняя граница диапазона измерения по Входам", "STORED_DOT", "-999..9999"),
    AIN_H("Ain.H", 0xE2FD, "Верхняя граница диапазона измерения по Входам", "STORED_DOT", "-999..9999"),

    // Параметры регулятора
    REG_T("rEG.t", 0xBBAA, "Режим работы регулятора", "int8", "0..1"),
    PB("Pb", 0xF58A, "Полоса пропорциональности", "STORED_DOT", "0.001..9999"),
    TI("ti", 0x9DE5, "Интегральная постоянная", "int16", "0..1092"),
    TD_TI("td.ti", 0xC83F, "Отношение дифференциальной постоянной к интегральной", "int16", "0..0.3"),
    I_UPR("i.UPr", 0xEE55, "Ограничение максимума интеграла", "int16", "-100..100"),
    I_MIN("i.min", 0xCF5C, "Ограничение минимума интеграла", "int16", "-100..100"),
    P_NOM("P.nom", 0x007A, "Номинальная мощность", "int16", "0..100"),
    P_UPR("P.UPr", 0x4FC2, "Максимальная выходная мощность", "int16", "0..100"),
    P_MIN("P.min", 0x6ECB, "Минимальная выходная мощность", "int16", "0..100"),
    P_STP("P.StP", 0xA7D4, "Выходная мощность в режиме Стоп", "int16", "0..100"),
    P_RES("P.rES", 0x4DAD, "Максимальная скорость изменения выходной мощности", "int16", "0..1000"),
    HYS_C("HYS.C", 0x1A9B, "Гистерезис двухпозиционного регулятора", "STORED_DOT", "0..9999"),
    DEL("dEL", 0x0D3E, "Время задержки переключения", "int8", "00:00..03:20"),
    HOLD("HoLd", 0xAF03, "Время удержания", "int8", "00:00..03:20"),

    // Автонастройка ПИД-регулятора
    YO("YO", 0x22B4, "Уставка автонастройки", "STORED_DOT", "-9999..9999"),
    YDOP("YdoP", 0x819C, "Максимально допустимое отклонение регулируемой величины", "STORED_DOT", "0..999"),

    // Выходной элемент 1
    POU("Pou", 0xA415, "Тип выходного элемента", "int8", "0..1"),
    THP("tHP", 0x7982, "Период следования ШИМ-импульсов", "int8", "00:01..01:21"),
    T_L("t.L", 0x07AA, "Минимальная длительность ШИМ-импульса", "int16", "0.05..0.5"),

    // Регистратор
    RG_ON("rG.on", 0xC363, "Включение регистратора", "int8", "0..1"),
    AO_L("Ao.L", 0x32C0, "Нижняя граница порога регистрации", "STORED_DOT", "-999..9999"),
    AO_H("Ao.H", 0x3F9D, "Верхняя граница порога регистрации", "STORED_DOT", "-999..9999"),

    // Программа технолога
    SP("SP", 0x9107, "Установка по шагам", "STORED_DOT", "-999..9999"),
    T_RS("t.rS", 0x567D, "Время роста по шагам", "int16", "0..1092"),
    T_STB("t.Stb", 0x7755, "Время выдержки по шагам", "int16", "0..1092"),

    // Устройство сигнализации
    SIG_T("SiG.t", 0xB085, "Тип логики срабатывания Устройства сигнализации", "int8", "0..1"),
    S_H("S.H", 0x5D62, "Верхний порог срабатывания сигнализации", "STORED_DOT", "0..9999"),
    S_L("S.L", 0xCEBE, "Нижний порог срабатывания сигнализации", "STORED_DOT", "0..9999"),
    LBA("LbA", 0x60AE, "Контроль LBA-аварии", "int8", "0..1"),
    D_LBA("d.LbA", 0x7860, "LBA – Минимально необходимое изменение регулируемой величины", "STORED_DOT", "0.001..9999"),
    T_LBA("t.LbA", 0x9398, "LBA – Время контроля LBA-аварии", "int16", "00:01..10:00"),

    // Сетевые параметры прибора
    BPS("bPS", 0xB760, "Скорость обмена данными", "int8", "0..8"),
    LEN("LEn", 0x523F, "Длина слова данных", "int8", "7..8"),
    PRTY("PrtY", 0xE8C4, "Контроль четности", "int8", "0..2"),
    SBIT("Sbit", 0xB72E, "Количество стоп-бит в посылке", "int8", "1..2"),
    A_LEN("A.Len", 0x1ED2, "Длина сетевого адреса", "int8", "8..11"),
    ADDR("Addr", 0x9F62, "Базовый адрес прибора", "int16", "0..2040"),
    PROT("Prot", 0x41F2, "Протокол обмена", "int8", "0..2"),
    DOT("dot", 0x133F, "Положение десятичной точки для сети Modbus", "int8", "0..3"),
    RS_DL("Rs.dL", 0xCBF5, "Время задержки ответа прибора", "int8", "0..50"),

    // Дополнительные параметры
    BEHV("bEHv", 0xCFE1, "Поведение после восстановления питания", "int8", "0..3"),
    T_SCL("t.SCL", 0xFA07, "Масштаб времени", "int8", "0..1"),
    NET_S("nEt.S", 0xD59F, "Запуск программ по сети", "int8", "0..1");

    private final String name;
    private final int hashCode;
    private final String description;
    private final String dataType;
    private final String range;

    ConfigParameter(String name, int hashCode, String description, String dataType, String range) {
        this.name = name;
        this.hashCode = hashCode;
        this.description = description;
        this.dataType = dataType;
        this.range = range;
    }

    public String getName() { return name; }
    public int getHashCode() { return hashCode; }
    public String getDescription() { return description; }
    public String getDataType() { return dataType; }
    public String getRange() { return range; }
}